Нужно придумать небольшую базу данных и написать к ней запросы.

В базе должно быть минимум 4 таблицы и хотя бы две связи вида one-to-many или many-to-many. Можно решить как при помощи pandas, так и при помощи SQL.

Запросы должны быть осмысленными и должны решать какую-то задачу.

### Easy
Выгрузить данные и отфильтровать их по какому-то значению.

### Normal
Написать запрос на объединение двух или более таблиц, также в запросе должна быть фильтрация

### Hard
Написать запрос, который посчитает какую-то сложную аналитику по БД, используя как можно больше таблиц. Построить графики и сделать выводы.

## Easy

In [1]:
import sqlite3
import pandas as pd

In [2]:
sql = sqlite3.connect('../data/workers.db')

In [3]:
# Таблица с должностями
work = ["Директор", "Заместитель директора", "Программист", "Уборщица", "Водитель"]
work_df = pd.DataFrame({'work': work})
work_df

work_df.to_sql('work', sql, index_label="id", if_exists='replace')
pd.read_sql("SELECT * FROM work", sql)

   id                   work
0   0               Директор
1   1  Заместитель директора
2   2            Программист
3   3               Уборщица
4   4               Водитель

In [4]:
# Таблица с образованием
skills = ["нет", "среднее", "среднее специальное", "высшее", "кандидат наук"]
skills_df = pd.DataFrame({'skills': skills})

skills_df.to_sql('skills', sql, index_label="id", if_exists='replace')
pd.read_sql("SELECT * FROM skills", sql)

   id               skills
0   0                  нет
1   1              среднее
2   2  среднее специальное
3   3               высшее
4   4        кандидат наук

In [6]:
# Таблица с семейным положением
status = ["женат / жената", "разведен / разведена", "не женат / не замужем"]
status_df = pd.DataFrame({'status': status})

status_df.to_sql('status', sql, index_label="id", if_exists='replace')
pd.read_sql("SELECT * FROM status", sql)

   id                 status
0   0         женат / жената
1   1   разведен / разведена
2   2  не женат / не замужем

## Normal

## Hard